tests/unit/api_contract/_api_checker/test_payment_plans/payment_plan.fixture.json

{
    "payment_plan": {
        "master": {
            "model": "payment.paymentplan",
            "pk": "6df18e58-3491-46b9-8918-e689bf3f2cdc",
            "fields": {
                "is_removed": false,
                "created_at": "2026-02-03T13:37:26.246Z",
                "updated_at": "2026-02-03T13:37:26.248Z",
                "version": 1770124899563935,
                "unicef_id": "PP-BA0000-26-00000001",
                "internal_data": {},
                "business_area": "47dbda3a-5643-407a-a8df-97d8ad9516aa",
                "program_cycle": "b00b8e87-5287-44a9-9465-7fa88056b632",
                "delivery_mechanism": null,
                "financial_service_provider": null,
                "imported_file": null,
                "export_file_entitlement": null,
                "export_file_per_fsp": null,
                "export_pdf_file_summary": null,
                "reconciliation_import_file": null,
                "steficon_rule": null,
                "steficon_rule_targeting": null,
                "created_by": "714509b8-11d4-4f7b-bf17-9230dc549986",
                "source_payment_plan": null,
                "storage_file": null,
                "name": null,
                "start_date": null,
                "end_date": null,
                "currency": null,
                "dispersion_start_date": "2026-02-03",
                "dispersion_end_date": "2026-03-05",
                "excluded_ids": null,
                "exclusion_reason": null,
                "vulnerability_score_min": null,
                "vulnerability_score_max": null,
                "abort_comment": "",
                "status": "OPEN",
                "background_action_status": null,
                "build_status": null,
                "built_at": null,
                "exchange_rate": null,
                "female_children_count": 0,
                "male_children_count": 0,
                "female_adults_count": 0,
                "male_adults_count": 0,
                "total_households_count": 0,
                "total_individuals_count": 0,
                "imported_file_date": null,
                "total_entitled_quantity": null,
                "total_entitled_quantity_usd": null,
                "total_entitled_quantity_revised": null,
                "total_entitled_quantity_revised_usd": null,
                "total_delivered_quantity": null,
                "total_delivered_quantity_usd": null,
                "total_undelivered_quantity": null,
                "total_undelivered_quantity_usd": null,
                "steficon_targeting_applied_date": null,
                "steficon_applied_date": null,
                "is_follow_up": false,
                "exclude_household_error": null,
                "status_date": "2026-02-03T13:37:26.245Z",
                "is_cash_assist": false,
                "flag_exclude_if_active_adjudication_ticket": false,
                "flag_exclude_if_on_sanction_list": false
            }
        },
        "deps": [
            {
                "model": "core.businessarea",
                "pk": "47dbda3a-5643-407a-a8df-97d8ad9516aa",
                "fields": {
                    "created_at": "2026-02-03T13:37:26.132Z",
                    "updated_at": "2026-02-03T13:37:26.132Z",
                    "code": "BA0000",
                    "slug": "business-area-0",
                    "name": "Business Area 0",
                    "long_name": "Business Area 0 Long Name",
                    "parent": null,
                    "office_country": null,
                    "is_split": false,
                    "region_code": "64",
                    "region_name": "TEST",
                    "has_data_sharing_agreement": false,
                    "is_accountability_applicable": false,
                    "rdi_import_xlsx_disabled": false,
                    "active": true,
                    "enable_email_notification": true,
                    "kobo_username": null,
                    "kobo_token": null,
                    "kobo_url": null,
                    "rapid_pro_host": null,
                    "rapid_pro_payment_verification_token": null,
                    "rapid_pro_messages_token": null,
                    "rapid_pro_survey_token": null,
                    "postpone_deduplication": false,
                    "deduplication_duplicate_score": 6.0,
                    "deduplication_possible_duplicate_score": 6.0,
                    "deduplication_batch_duplicates_percentage": 50,
                    "deduplication_batch_duplicates_allowed": 5,
                    "deduplication_golden_record_duplicates_percentage": 50,
                    "deduplication_golden_record_duplicates_allowed": 5,
                    "deduplication_ignore_withdraw": false,
                    "biometric_deduplication_threshold": 0.0,
                    "custom_fields": {},
                    "countries": [],
                    "payment_countries": []
                }
            },
            {
                "model": "program.programcycle",
                "pk": "b00b8e87-5287-44a9-9465-7fa88056b632",
                "fields": {
                    "created_at": "2026-02-03T13:37:26.244Z",
                    "updated_at": "2026-02-03T13:37:26.244Z",
                    "version": 1770124899559776,
                    "unicef_id": "PC-BA0000-26-000001",
                    "title": "Default Programme Cycle",
                    "program": "673f132a-607c-4cc9-a48a-9542fc11f289",
                    "status": "ACTIVE",
                    "start_date": "2026-02-03",
                    "end_date": null,
                    "created_by": null
                }
            },
            {
                "model": "program.program",
                "pk": "673f132a-607c-4cc9-a48a-9542fc11f289",
                "fields": {
                    "is_removed": false,
                    "created_at": "2026-02-03T13:37:26.167Z",
                    "updated_at": "2026-02-03T13:37:26.167Z",
                    "last_sync_at": null,
                    "version": 1770124899511564,
                    "data_collecting_type": 1,
                    "beneficiary_group": "bd30915a-10f5-4bec-b020-89cfb3cf5f6c",
                    "business_area": "47dbda3a-5643-407a-a8df-97d8ad9516aa",
                    "name": "Program 0",
                    "programme_code": "W4EH",
                    "status": "ACTIVE",
                    "slug": "w4eh",
                    "description": "",
                    "start_date": "2026-02-03",
                    "end_date": "2027-02-03",
                    "sector": "MULTI_PURPOSE",
                    "budget": "1000000.00",
                    "frequency_of_payments": "ONE_OFF",
                    "scope": null,
                    "partner_access": "SELECTED_PARTNERS_ACCESS",
                    "cash_plus": false,
                    "population_goal": 1000,
                    "administrative_areas_of_implementation": "",
                    "biometric_deduplication_enabled": false,
                    "collision_detector": "hope.apps.program.collision_detectors.NoopCollisionDetector",
                    "is_visible": true,
                    "household_count": 0,
                    "individual_count": 0,
                    "reconciliation_window_in_days": 0,
                    "send_reconciliation_window_expiry_notifications": false,
                    "admin_areas": [],
                    "sanction_lists": []
                }
            },
            {
                "model": "core.datacollectingtype",
                "pk": 1,
                "fields": {
                    "created": "2026-02-03T13:37:26.157Z",
                    "modified": "2026-02-03T13:37:26.157Z",
                    "code": "dct_0",
                    "label": "DCT 0",
                    "type": "STANDARD",
                    "description": "",
                    "active": true,
                    "deprecated": false,
                    "individual_filters_available": false,
                    "household_filters_available": true,
                    "recalculate_composition": false,
                    "weight": 0,
                    "compatible_types": [
                        1
                    ],
                    "limit_to": []
                }
            },
            {
                "model": "program.beneficiarygroup",
                "pk": "bd30915a-10f5-4bec-b020-89cfb3cf5f6c",
                "fields": {
                    "created_at": "2026-02-03T13:37:26.161Z",
                    "updated_at": "2026-02-03T13:37:26.161Z",
                    "name": "Group 0",
                    "group_label": "Household",
                    "group_label_plural": "Households",
                    "member_label": "Individual",
                    "member_label_plural": "Individuals",
                    "master_detail": true
                }
            },
            {
                "model": "account.user",
                "pk": "714509b8-11d4-4f7b-bf17-9230dc549986",
                "fields": {
                    "password": "",
                    "last_login": null,
                    "is_superuser": true,
                    "username": "user_0",
                    "first_name": "",
                    "last_name": "",
                    "is_staff": true,
                    "is_active": true,
                    "date_joined": "2026-02-03T13:37:26.107Z",
                    "azure_id": null,
                    "display_name": "user_0",
                    "status": "INVITED",
                    "partner": 3,
                    "email": "user_0@example.com",
                    "custom_fields": {},
                    "job_title": "",
                    "last_modify_date": "2026-02-03T13:37:26.242Z",
                    "groups": [],
                    "user_permissions": []
                }
            },
            {
                "model": "account.partner",
                "pk": 3,
                "fields": {
                    "name": "Partner 0",
                    "parent": null,
                    "is_un": false,
                    "lft": 1,
                    "rght": 2,
                    "tree_id": 2,
                    "level": 0,
                    "allowed_business_areas": []
                }
            }
        ]
    }
}